use parser::util::char_slice;

fn main() {
    let input =
        "
إذا ابتُلي الرجلان بدخول الكذوب الخؤون بينهما تقاطعا وتدابرا وتفاسد
ما بينهما Lo-2-7 ومن أمثال ذلك أنّه كان بأرض دستنابد تاجر مكثر وله
بنون Lo-2-8 فلمّا أدركوا شرعوا في مال أبيهم ولم يحترفوا حرفة يكتسبون بها مالًا
فلامهم أبوهم ووعظهم Lo-2-9 وكان ممّا قال لهم يا بنيّ إنّ صاحب الدنيا يطلب
ثلاثة أمور لن تُدرك إلّا بأربعة أشياء Lo-2-10 أمّا الثلاثة التي يطلب فالسعة في
المعيشة والمنزلة في الناس والزاد إلى الآخرة Lo-2-11 وأمّا الأربعة التي يحتاج
إليها في إدراك هذه الثلاثة فاكتساب المال من أحسن وجوهه ثمّ حسن
القيام {لما اكتسب والتثمير له ثمّ} [[عليه ثمّ التثمير]] [ثمّ] إنفاقه فيما يصلح المعيشة ويرضي به الله تعالى والأهل
والإخوان ويعود في الآخرة نفعه عليه Lo-2-14 فمن أضاع شيئا من هذه الخلال الأربع
لم يدرك ما أراد {من حاجة} فإنّه إن لم يكتسب لم يكن له مال يعيش به Lo-2-15 وإن كان هو ذو
مال وذو اكتساب [[ثمّ]] ولم يحسن القيام عليه أوشك أن يفنى ويبقى بغير
مال Lo-2-16 وإن هو أنفقه ولم يثمّره لم تمنعه قلّة الإنفاق من سرعة النفاق Lo-2-17 كالكحل
الذي لا يؤخذ منه إلّا مثل الغبار ثمّ هو مع ذلك سريع فناؤه Lo-2-19 وإن كانت نفقته
في غير مواضع الحقوق كان بمنزلة الفقير الذي لا مال له ثمّ لم ينفعه ذلك
من تلاف المال للمقادير والعلل Lo-2-20 كالمكان الذي لا تزال تنصب فيه المياه فإنّه
";

    let processed_input = input.lines().map(str::trim).collect::<Vec<&str>>().join("\n");
    dbg!(processed_input.chars().count());
    // let input = input.to_string();
    // println!("slice: {}", &input[4099..=4166]);
    dbg!(char_slice(&processed_input, 1170, 1175));
}
